# IncorrectWallUsageWithAttachedStruct Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..IncorrectWallUsageWithAttachedStruct Property
BuiltInFailures..::..TrussFailures Class See Also
---
A structural framing element is attached to a wall whose Structural Usage is set to [Usage].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IncorrectWallUsageWithAttachedStruct { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IncorrectWallUsageWithAttachedStruct As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IncorrectWallUsageWithAttachedStruct {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace